[{"Name":"Dwarf","ShortDescription":"Dwarves are a short, stocky people who are often stubborn, fierce, and devoted.","Description1":"Dwarves have a well-earned reputation as a stoic and stern people, but they also have an unbridled zeal and deeply value artisanship. To a stranger, they can seem untrusting and clannish, but to their friends and family, they are warm and caring. While trust from a dwarf is hard-won, once gained it is as strong as iron.","Description2":"If you want to play a character who is as hard as nails, a stubborn and unrelenting adventurer, with a mix of rugged toughness and deep wisdom, you should play a dwarf.","YouMight":["Strive to uphold your personal honor and refuse to back down","Appreciate quality craftsmanship in all forms and insist upon it for all your gear"],"OthersProbably":["See you as stubborn, though whether this is an asset or a detriment changes from moment to moment","Recognize the deep connection you have with your family, heritage, and friends"],"InfoLink":"https://2e.aonprd.com/Ancestries.aspx?ID=59","KnownFor":"Resilient, stoic, and tradition-bound, dwarves often embody determination and pride in their crafts and heritage","PairWellWith":"Fighter, Cleric, Ranger","KeyAttributes":"High Constitution and Wisdom, with excellent fortitude and durability","TypicalCharacteristics":["Hard as nails","Stubborn and unrelenting adventurer","Rugged toughness and deep wisdom","Recognize the deep connection you have with your family, heritage, and friends."],"BaseHitPoints":10,"Size":2,"BaseSpeed":20,"AttributeBoosts":["Constitution","Wisdom","Free"],"AttributeFlaws":["Charisma"],"BaseLanguages":["Common","Dwarven"],"Abilities":[{"Name":"Darkvision","Description":"You can see in darkness and dim light just as well as you can see in bright light, though your vision in darkness is in black and white."},{"Name":"Clan Dagger","Description":"You get one clan dagger for free, as it was given to you at birth. Selling this clan dagger is a terrible taboo and earns you the disdain of other dwarves."}],"Traits":[0,6]},{"Name":"Elf","ShortDescription":"Elves are a tall, long-lived people with a strong tradition of art and magic.","Description1":"As an ancient people, elves have seen great change and have the perspective that can come only from watching the arc of history. After leaving Golarion in ancient times, they returned to a changed land, and they still struggle to reclaim their ancestral homes. Elves value kindness, intellect, and beauty, with many elves striving to improve their manners, appearance, and culture. Their studies delve into a level of detail that most shorter-lived peoples find excessive or inefficient. Elves are often rather private people, steeped in the secrets of their groves and kinship groups. They\u0027re slow to build friendships outside their kinsfolk, as elves who spend their lives among shorter-lived peoples often become morose after watching generations of companions age and die. These elves are known as Forlorn among their fellow elves.","Description2":"","YouMight":["Carefully curate your relationships with people with shorter lifespans","Adopt specialized or obscure interests simply for the sake of mastering them"],"OthersProbably":["Focus on your appearance, either admiring your grace or treating you as if you\u0027re physically fragile","Worry that you privately look down on them, or feel like you\u0027re condescending and aloof"],"InfoLink":"https://2e.aonprd.com/Ancestries.aspx?ID=60","KnownFor":"Graceful and perceptive, elves are often wise or enigmatic, with a deep connection to nature or magic","PairWellWith":"Wizard, Rogue, Ranger","KeyAttributes":"High Dexterity and Intelligence, with a natural affinity for speed and magic","TypicalCharacteristics":["Tall, long-lived people with a strong tradition of art and magic","Magical, mystical, and mysterious","Carefully curate relationships with people with shorter lifespans","Adopt specialized or obscure interests simply for the sake of mastering them"],"BaseHitPoints":6,"Size":2,"BaseSpeed":30,"AttributeBoosts":["Dexterity","Intelligence","Free"],"AttributeFlaws":["Constitution"],"BaseLanguages":["Common","Elven"],"Abilities":[{"Name":"Low-Light Vision","Description":"You can see in dim light as though it were bright light, so you ignore the concealed condition due to dim light."}],"Traits":[1,6]},{"Name":"Gnome","ShortDescription":"Gnomes are short and hardy folk, with an unquenchable curiosity and eccentric habits.","Description1":"Long ago, early gnome ancestors emigrated from the First World, realm of the fey. While it\u0027s unclear why the first gnomes wandered to Golarion, this lineage manifests in modern gnomes as bizarre reasoning, eccentricity, obsessive tendencies, and what some see as naivete.","Description2":"Always hungry for new experiences, gnomes constantly wander both mentally and physically, attempting to stave off a terrible ailment that threatens all of their people. This affliction, known as the Bleaching, strikes gnomes who fail to dream, innovate, and take in new experiences. The Bleaching slowly drains the color— literally—from gnomes, and it plunges those affected into states of deep depression that eventually claim their lives. Very few gnomes survive this scourge, becoming deeply morose and wise survivors known as bleachlings.","YouMight":["Embrace learning and hop from one area of study to another without warning","Speak, think, and move quickly, and lose patience with those who can\u0027t keep up"],"OthersProbably":[""],"InfoLink":"https://2e.aonprd.com/Ancestries.aspx?ID=61","KnownFor":"Curious and eccentric, gnomes bring color and wonder to any group, with an insatiable thirst for new experiences","PairWellWith":"Bard, Sorcerer, Druid","KeyAttributes":"High Charisma and Constitution, with innate magic and adaptability","TypicalCharacteristics":["Embrace learning and hop from one area of study to another without warning","Speak, think, and move quickly, and lose patience with those who can\u0027t keep up","Appreciate your enthusiasm and the energy with which you approach new situations","Struggle to understand your motivations or adapt to your rapid changes of direction"],"BaseHitPoints":8,"Size":1,"BaseSpeed":25,"AttributeBoosts":["Constitution","Charisma","Free"],"AttributeFlaws":["Strength"],"BaseLanguages":["Common","Fey","Gnomish"],"Abilities":[{"Name":"Low-light Vision","Description":"You can see in dim light as though it were bright light, so you ignore the concealed condition due to dim light."}],"Traits":[2,6]},{"Name":"Halfling","ShortDescription":"Halflings are a short, resilient people who exhibit remarkable curiosity and humor.","Description1":"Claiming no place as their own, halflings control few settlements larger than villages. Instead, they frequently live among humans within larger cities, carving out small communities alongside taller folk. Optimistic, cheerful, and driven by powerful wanderlust, halflings make up for their short stature with an abundance of bravado. At once excitable and easygoing, halflings are the best kind of opportunists, and their passions favor joy over violence. While their curiosity sometimes drives them toward adventure, halflings also carry strong ties to house and home.","Description2":"","YouMight":["Get along well with a wide variety of people and enjoy meeting new friends","Find it difficult to resist indulging your curiosity, even when you know it\u0027s going to lead to trouble"],"OthersProbably":["Appreciate your ability to always find a silver lining or something to laugh about, no matter how dire the situation","Think you bring good luck with you"],"InfoLink":"https://2e.aonprd.com/Ancestries.aspx?ID=63","KnownFor":"Optimistic and community-driven, halflings are brave and resourceful, with a knack for making the best of any situation","PairWellWith":"Rogue, Bard, Monk","KeyAttributes":"High Dexterity and Charisma, with a focus on luck, agility, and adaptability","TypicalCharacteristics":["Get along well with a wide variety of people and enjoy meeting new friends","Find it difficult to resist indulging your curiosity, even when you know it\u0027s going to lead to trouble","Appreciate your ability to always find a silver lining or something to laugh about, no matter how dire the situation","Think you bring good luck with you"],"BaseHitPoints":6,"Size":1,"BaseSpeed":25,"AttributeBoosts":["Dexterity","Wisdom","Free"],"AttributeFlaws":["Strength"],"BaseLanguages":["Common","Halfling"],"Abilities":[{"Name":"Keen Eyes","Description":"Your eyes are sharp, allowing you to make out small details about concealed or even invisible creatures that others might miss. You gain a \u002B2 circumstance bonus when using the Seek action to find hidden or undetected creatures within 30 feet of you. When you target an opponent that is concealed from you or hidden from you, reduce the DC of the flat check to 3 for a concealed target or 9 for a hidden one."}],"Traits":[4,6]},{"Name":"Human","ShortDescription":"Humans are diverse and adaptable people with wide potential and deep ambitions.","Description1":"As unpredictable and varied as any of Golarion\u0027s peoples, humans have exceptional drive and the capacity to endure and expand. Though many civilizations thrived before humanity rose to prominence, humans have built some of the greatest and the most terrible societies throughout the course of history, and today they are the most populous people in the realms around the Inner Sea.","Description2":"Humans\u0027 ambition, versatility, and exceptional potential have led to their status as the world\u0027s predominant ancestry. Their empires and nations are vast, sprawling things, and their citizens carve names for themselves with the strength of their sword arms and the power of their spells. Humanity is diverse and tumultuous, running the gamut from nomadic to imperial, sinister to saintly. Many of them venture forth to explore, to map the expanse of the multiverse, to search for long-lost treasure, or to lead mighty armies to conquer their neighbors—for no better reason than because they can.","YouMight":["Strive to achieve greatness, either in your own right or on behalf of a cause","Seek to understand your purpose in the world","Cherish your relationships with family and friends"],"OthersProbably":["Respect your flexibility, your adaptability, and—in most cases—your open-mindedness","Distrust your intentions, fearing you seek only power or wealth","Aren\u0027t sure what to expect from you and are hesitant to assume your intentions"],"InfoLink":"https://2e.aonprd.com/Ancestries.aspx?ID=64","KnownFor":"Versatile and ambitious, humans excel at adaptation and have a strong drive to make their mark in the world","PairWellWith":"Any class, especially Fighter, Sorcerer, and Cleric","KeyAttributes":"Flexible ability boosts, allowing humans to fit well into any class","TypicalCharacteristics":["Strive to achieve greatness, either in your own right or on behalf of a cause","Seek to understand your purpose in the world","Cherish your relationships with family and friends","Respect your flexibility, your adaptability, and—in most cases—your open-mindedness","Distrust your intentions, fearing you seek only power or wealth","Aren\u0027t sure what to expect from you and are hesitant to assume your intentions"],"BaseHitPoints":8,"Size":2,"BaseSpeed":25,"AttributeBoosts":["Free","Free"],"AttributeFlaws":[],"BaseLanguages":["Common"],"Abilities":[],"Traits":[5,6]},{"Name":"Leshy","ShortDescription":"Leshies are immortal nature spirits placed in small plant bodies, seeking to experience the world.","Description1":"Leshies are immortal spirits of nature temporarily granted physical forms. As guardians and emissaries of the environment, leshies are “born” when a skilled druid or other master of primal magic conducts a ritual to create a suitable vessel, and then a spirit chooses that vessel to be their temporary home. Leshies are self-sufficient from the moment the ritual ends, though it isn\u0027t uncommon for leshies to maintain lifelong bonds with their creators. Many leshies relish the opportunity to interact with the physical world. While most leshy spirits are ancient, they rarely recall past lifetimes and see their new life as a chance to experience the wonders of the world once more.","Description2":"","YouMight":["Act as a traveling agent for natural guardians who are unable to leave their territories","Encourage civilizations to cooperate with nature and build their cities in ecologically friendly ways"],"OthersProbably":["Think you are a curiosity due to your spiritual origins","Assume you know only about nature and are unfamiliar with civilization and society"],"InfoLink":"https://2e.aonprd.com/Ancestries.aspx?ID=65","KnownFor":"Playful and nature-bound, leshies are plant-like beings with a deep bond to the natural world and a curious, gentle outlook","PairWellWith":"Druid, Ranger, Cleric","KeyAttributes":"High Wisdom and Constitution, with abilities tied to plants and survival in wilderness environments","TypicalCharacteristics":["Act as a traveling agent for natural guardians who are unable to leave their territories","Encourage civilizations to cooperate with nature and build their cities in ecologically friendly ways","Think you are a curiosity due to your spiritual origins","Assume you know only about nature and are unfamiliar with civilization and society"],"BaseHitPoints":8,"Size":1,"BaseSpeed":25,"AttributeBoosts":["Constitution","Wisdom","Free"],"AttributeFlaws":["Intelligence"],"BaseLanguages":["Common","Fey"],"Abilities":[{"Name":"Low-light Vision","Description":"You can see in dim light as though it were bright light, so you ignore the concealed condition due to dim light."},{"Name":"Plant Nourishment","Description":"You gain nourishment in the same way that the plants or fungi that match your body type normally do, through some combination of photosynthesis, absorbing minerals with your roots, or scavenging decaying matter. You typically do not need to pay for food. If you normally rely on photosynthesis and go without sunlight for 1 week, you begin to starve. You can derive nourishment from specially formulated bottles of sunlight instead of natural sunlight, but these bottles cost 10 times as much as standard rations (or 40 sp)."}],"Traits":[7,9]},{"Name":"Orc","ShortDescription":"Orcs are proud, strong people with hardened physiques who value physical might and glory in combat.","Description1":"Orcs are forged in the fires of violence and conflict, often from the moment they are born. As they live lives that are frequently cut brutally short, orcs revel in testing their strength against worthy foes, often by challenging a higher-ranking member of their community for dominance. Orcs often struggle to gain acceptance among other communities, who frequently see them as brutes. Those who earn the loyalty of an orc friend, however, soon learn that an orc\u0027s fidelity and honesty are unparalleled. Orc culture teaches that they are shaped by the challenges they survive, and the most worthy survive the most hardships. Orcs who attain both a long life and great triumphs command immense respect.","Description2":"","YouMight":["Eagerly meet any chance to prove your strength in a physical contest","View dying in glorious combat as preferable to a mundane death from old age or illness"],"OthersProbably":["See you as violent or lacking in discipline","Admire your forthrightness and blunt honesty"],"InfoLink":"https://2e.aonprd.com/Ancestries.aspx?ID=66","KnownFor":"Fierce and proud, orcs are known for their physical prowess, bravery, and strong warrior culture","PairWellWith":"Barbarian, Fighter, Champion","KeyAttributes":"High Strength and Constitution, excelling in raw power and resilience in combat","TypicalCharacteristics":["Eagerly meet any chance to prove your strength in a physical contest","View dying in glorious combat as preferable to a mundane death from old age or illness","Others see you as violent or lacking in discipline","Others admire your forthrightness and blunt honesty"],"BaseHitPoints":10,"Size":2,"BaseSpeed":25,"AttributeBoosts":["Free","Free"],"AttributeFlaws":[],"BaseLanguages":["Common","Orcish"],"Abilities":[{"Name":"Darkvision","Description":"You can see in darkness and dim light just as well as you can see in bright light, though your vision in darkness is in black and white."}],"Traits":[8,6]}]